---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ElectricalEquipment
source: html/654804b7-7ff1-59e9-11a2-fbce21e34e46.htm
---
# ElectricalEquipment Members

Causes the object to release immediately any resources it may be utilizing.